In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [3]:
obj[1]

1.0

In [4]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [5]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [6]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [7]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [8]:
# 利用标签的切片运算，是 末端 包含 的
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [9]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [13]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [14]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [15]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [17]:
data.ix['Ohio']

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [18]:
data.ix['Ohio'][0]

0

In [19]:
data.ix['Ohio'].index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [20]:
data.ix['Ohio']['one']

0

In [21]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [22]:
# 取出 data three 列 >5 的所有行
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [26]:
data[data<5] = 0

In [27]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [28]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [29]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [31]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [32]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [34]:
data.ix[data.three > 5, :2]

          one  two
Colorado    0    5
Utah        8    9
New York   12   13

In [35]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
# 先选择列，再选择行
data['one'][1:3]

Colorado    0
Utah        8
Name: one, dtype: int32

In [37]:
# 先选择行，再选择列
data.ix[1:3, ['one']]

          one
Colorado    0
Utah        8